Revit 2026 API

# CableTraySettingsSizeSuffix Property

---

The cable tray size suffix string.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string SizeSuffix { get; set; }
```
```vb
Public Property SizeSuffix As String
	Get
	Set
```
```cpp
public:
property String^ SizeSuffix {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member SizeSuffix : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

CableTraySettings Class

Autodesk.Revit.DB.Electrical Namespace